# 1. Використовуємо офіційний Node.js образ як базовий
FROM node:18-alpine

# 2. Вказуємо робочу директорію всередині контейнера
WORKDIR /app

# 3. Копіюємо package.json і package-lock.json (якщо є) у контейнер
COPY package*.json ./

# 4. Встановлюємо залежності
RUN npm install

# 5. Копіюємо решту коду у контейнер
COPY . .

# 6. Відкриваємо порти, якщо додаток працює на певному порту
EXPOSE 5173 3000

# 7. Вказуємо команду для запуску додатку
CMD ["npm", "run", "dev", "--", "--host", "0.0.0.0"]
